nxp-appcodehub/dm-power-delivery-frdm-a-s32k344/src/drivers/inc/ptn5110_register.h
/* EXTENDED_STATUS_MASK : */
#define TCPC_EXTENDED_STATUS_MASK_IDX                     0x16U
#define TCPC_EXTENDED_STATUS_MASK_POR                     0xFFU
#define TCPC_EXTENDED_STATUS_MASK_VSAFE0_STATUS_MASK_MSB  0U
#define TCPC_EXTENDED_STATUS_MASK_VSAFE0_STATUS_MASK_LSB  0U
#define TCPC_EXTENDED_STATUS_MASK_VSAFE0_STATUS_MASK_MASK 0x01U

/* ALERT_EXTENDED_MASK : */
#define TCPC_ALERT_EXTENDED_MASK_IDX                             0x17U
#define TCPC_ALERT_EXTENDED_MASK_POR                             0xFFU
#define TCPC_ALERT_EXTENDED_MASK_TIMER_EXPIRED_MASK_MSB          2U
#define TCPC_ALERT_EXTENDED_MASK_TIMER_EXPIRED_MASK_LSB          2U
#define TCPC_ALERT_EXTENDED_MASK_TIMER_EXPIRED_MASK_MASK         0x04U
#define TCPC_ALERT_EXTENDED_MASK_SOURCE_FAST_ROLE_SWAP_MASK_MSB  1U
#define TCPC_ALERT_EXTENDED_MASK_SOURCE_FAST_ROLE_SWAP_MASK_LSB  1U
#define TCPC_ALERT_EXTENDED_MASK_SOURCE_FAST_ROLE_SWAP_MASK_MASK 0x02U
#define TCPC_ALERT_EXTENDED_MASK_SINK_FAST_ROLE_SWAP_MASK_MSB    0U
#define TCPC_ALERT_EXTENDED_MASK_SINK_FAST_ROLE_SWAP_MASK_LSB    0U
#define TCPC_ALERT_EXTENDED_MASK_SINK_FAST_ROLE_SWAP_MASK_MASK   0x01U

/* CONFIGURE_STANDARD_OUTPUT : */
#define TCPC_CONFIGURE_STANDARD_OUTPUT_IDX                              0x18U
#define TCPC_CONFIGURE_STANDARD_OUTPUT_HIGH_IMPEDANCE_OUTPUTS_MSB       7U
#define TCPC_CONFIGURE_STANDARD_OUTPUT_HIGH_IMPEDANCE_OUTPUTS_LSB       7U
#define TCPC_CONFIGURE_STANDARD_OUTPUT_HIGH_IMPEDANCE_OUTPUTS_MASK      0x0080U
#define TCPC_CONFIGURE_STANDARD_OUTPUT_DEBUG_ACCESSORY_CONNECTED_MSB    6U
#define TCPC_CONFIGURE_STANDARD_OUTPUT_DEBUG_ACCESSORY_CONNECTED_LSB    6U
#define TCPC_CONFIGURE_STANDARD_OUTPUT_DEBUG_ACCESSORY_CONNECTED_MASK   0x0040U
#define TCPC_CONFIGURE_STANDARD_OUTPUT_AUDIO_ACCESSORY_CONNECTED_MSB    5U
#define TCPC_CONFIGURE_STANDARD_OUTPUT_AUDIO_ACCESSORY_CONNECTED_LSB    5U
#define TCPC_CONFIGURE_STANDARD_OUTPUT_AUDIO_ACCESSORY_CONNECTED_MASK   0x0020U
#define TCPC_CONFIGURE_STANDARD_OUTPUT_ACTIVE_CABLE_CONNECTED_MSB       4U
#define TCPC_CONFIGURE_STANDARD_OUTPUT_ACTIVE_CABLE_CONNECTED_LSB       4U
#define TCPC_CONFIGURE_STANDARD_OUTPUT_ACTIVE_CABLE_CONNECTED_MASK      0x0010U
#define TCPC_CONFIGURE_STANDARD_OUTPUT_MUX_CONTROL_MSB                  3U
#define TCPC_CONFIGURE_STANDARD_OUTPUT_MUX_CONTROL_LSB                  2U
#define TCPC_CONFIGURE_STANDARD_OUTPUT_MUX_CONTROL_MASK                 0x000CU
#define TCPC_CONFIGURE_STANDARD_OUTPUT_CONNECTION_PRESENT_MSB           1U
#define TCPC_CONFIGURE_STANDARD_OUTPUT_CONNECTION_PRESENT_LSB           1U
#define TCPC_CONFIGURE_STANDARD_OUTPUT_CONNECTION_PRESENT_MASK          0x0002U
#define TCPC_CONFIGURE_STANDARD_OUTPUT_CONNECTOR_ORIENTATION_GPIO0_MSB  0U
#define TCPC_CONFIGURE_STANDARD_OUTPUT_CONNECTOR_ORIENTATION_GPIO0_LSB  0U
#define TCPC_CONFIGURE_STANDARD_OUTPUT_CONNECTOR_ORIENTATION_GPIO0_MASK 0x0001U

/* TCPC_CONTROL : */
#define TCPC_TCPC_CONTROL_IDX                                0x19U
#define TCPC_TCPC_CONTROL_DEBUG_ACCESSORY_CONTROL_MSB        4U
#define TCPC_TCPC_CONTROL_DEBUG_ACCESSORY_CONTROL_LSB        4U
#define TCPC_TCPC_CONTROL_DEBUG_ACCESSORY_CONTROL_MASK       0x0010U
#define TCPC_TCPC_CONTROL_I2_C_CLOCK_STRETCHING_CONTROL_MSB  3U
#define TCPC_TCPC_CONTROL_I2_C_CLOCK_STRETCHING_CONTROL_LSB  2U
#define TCPC_TCPC_CONTROL_I2_C_CLOCK_STRETCHING_CONTROL_MASK 0x000CU
#define TCPC_TCPC_CONTROL_BIST_TEST_MODE_MSB                 1U
#define TCPC_TCPC_CONTROL_BIST_TEST_MODE_LSB                 1U
#define TCPC_TCPC_CONTROL_BIST_TEST_MODE_MASK                0x0002U
#define TCPC_TCPC_CONTROL_PLUG_ORIENTATION_MSB               0U
#define TCPC_TCPC_CONTROL_PLUG_ORIENTATION_LSB               0U
#define TCPC_TCPC_CONTROL_PLUG_ORIENTATION_MASK              0x0001U

/* ROLE_CONTROL : */
#define TCPC_ROLE_CONTROL_IDX           0x1AU
#define TCPC_ROLE_CONTROL_DRP_MSB       6U
#define TCPC_ROLE_CONTROL_DRP_LSB       6U
#define TCPC_ROLE_CONTROL_DRP_MASK      0x0040U
#define TCPC_ROLE_CONTROL_RP_VALUE_MSB  5U
#define TCPC_ROLE_CONTROL_RP_VALUE_LSB  4U
#define TCPC_ROLE_CONTROL_RP_VALUE_MASK 0x0030U
#define TCPC_ROLE_CONTROL_CC2_MSB       3U
#define TCPC_ROLE_CONTROL_CC2_LSB       2U
#define TCPC_ROLE_CONTROL_CC2_MASK      0x000CU
#define TCPC_ROLE_CONTROL_CC1_MSB       1U
#define TCPC_ROLE_CONTROL_CC1_LSB       0U
#define TCPC_ROLE_CONTROL_CC1_MASK      0x0003U

/* FAULT_CONTROL : */
#define TCPC_FAULT_CONTROL_IDX                                            0x1BU
#define TCPC_FAULT_CONTROL_FORCE_OFF_VBUS_ENABLE_MSB                      4U
#define TCPC_FAULT_CONTROL_FORCE_OFF_VBUS_ENABLE_LSB                      4U
#define TCPC_FAULT_CONTROL_FORCE_OFF_VBUS_ENABLE_MASK                     0x0010U
#define TCPC_FAULT_CONTROL_VBUS_DISCHARGE_TIMER_MSB                       3U
#define TCPC_FAULT_CONTROL_VBUS_DISCHARGE_TIMER_LSB                       3U
#define TCPC_FAULT_CONTROL_VBUS_DISCHARGE_TIMER_MASK                      0x0008U
#define TCPC_FAULT_CONTROL_VBUS_OVER_CURRENT_PROTECTION_FAULT_ENABLE_MSB  2U
#define TCPC_FAULT_CONTROL_VBUS_OVER_CURRENT_PROTECTION_FAULT_ENABLE_LSB  2U
#define TCPC_FAULT_CONTROL_VBUS_OVER_CURRENT_PROTECTION_FAULT_ENABLE_MASK 0x0004U
#define TCPC_FAULT_CONTROL_VBUS_OVER_VOLTAGE_PROTECTION_FAULT_ENABLE_MSB  1U
#define TCPC_FAULT_CONTROL_VBUS_OVER_VOLTAGE_PROTECTION_FAULT_ENABLE_LSB  1U
#define TCPC_FAULT_CONTROL_VBUS_OVER_VOLTAGE_PROTECTION_FAULT_ENABLE_MASK 0x0002U
#define TCPC_FAULT_CONTROL_VCONN_OVER_CURRENT_FAULT_ENABLE_MSB            0U
#define TCPC_FAULT_CONTROL_VCONN_OVER_CURRENT_FAULT_ENABLE_LSB            0U
#define TCPC_FAULT_CONTROL_VCONN_OVER_CURRENT_FAULT_ENABLE_MASK           0x0001U

/* POWER_CONTROL : */
#define TCPC_POWER_CONTROL_IDX                            0x1CU
#define TCPC_POWER_CONTROL_POR                            0x60U
#define TCPC_POWER_CONTROL_FAST_ROLE_SWAP_ENABLE_MSB      7U
#define TCPC_POWER_CONTROL_FAST_ROLE_SWAP_ENABLE_LSB      7U
#define TCPC_POWER_CONTROL_FAST_ROLE_SWAP_ENABLE_MASK     0x0080U
#define TCPC_POWER_CONTROL_VBUS_VOLTAGE_MONITOR_MSB       6U
#define TCPC_POWER_CONTROL_VBUS_VOLTAGE_MONITOR_LSB       6U
#define TCPC_POWER_CONTROL_VBUS_VOLTAGE_MONITOR_MASK      0x0040U
#define TCPC_POWER_CONTROL_DISABLE_VOLTAGE_ALARMS_MSB     5U
#define TCPC_POWER_CONTROL_DISABLE_VOLTAGE_ALARMS_LSB     5U
#define TCPC_POWER_CONTROL_DISABLE_VOLTAGE_ALARMS_MASK    0x0020U
#define TCPC_POWER_CONTROL_AUTO_DISCHARGE_DISCONNECT_MSB  4U
#define TCPC_POWER_CONTROL_AUTO_DISCHARGE_DISCONNECT_LSB  4U
#define TCPC_POWER_CONTROL_AUTO_DISCHARGE_DISCONNECT_MASK 0x0010U
#define TCPC_POWER_CONTROL_ENABLE_BLEED_DISCHARGE_MSB     3U
#define TCPC_POWER_CONTROL_ENABLE_BLEED_DISCHARGE_LSB     3U
#define TCPC_POWER_CONTROL_ENABLE_BLEED_DISCHARGE_MASK    0x0008U
#define TCPC_POWER_CONTROL_FORCE_DISCHARGE_MSB            2U
#define TCPC_POWER_CONTROL_FORCE_DISCHARGE_LSB            2U
#define TCPC_POWER_CONTROL_FORCE_DISCHARGE_MASK           0x0004U
#define TCPC_POWER_CONTROL_VCONN_POWER_SUPPORTED_MSB      1U
#define TCPC_POWER_CONTROL_VCONN_POWER_SUPPORTED_LSB      1U
#define TCPC_POWER_CONTROL_VCONN_POWER_SUPPORTED_MASK     0x0002U
#define TCPC_POWER_CONTROL_ENABLE_VCONN_MSB               0U
#define TCPC_POWER_CONTROL_ENABLE_VCONN_LSB               0U
#define TCPC_POWER_CONTROL_ENABLE_VCONN_MASK              0x0001U

/* CC_STATUS : */
#define TCPC_CC_STATUS_IDX                      0x1DU
#define TCPC_CC_STATUS_LOOKING4_CONNECTION_MSB  5U
#define TCPC_CC_STATUS_LOOKING4_CONNECTION_LSB  5U
#define TCPC_CC_STATUS_LOOKING4_CONNECTION_MASK 0x0020U
#define TCPC_CC_STATUS_CONNECT_RESULT_MSB       4U
#define TCPC_CC_STATUS_CONNECT_RESULT_LSB       4U
#define TCPC_CC_STATUS_CONNECT_RESULT_MASK      0x0010U
#define TCPC_CC_STATUS_CC2_STATE_MSB            3U
#define TCPC_CC_STATUS_CC2_STATE_LSB            2U
#define TCPC_CC_STATUS_CC2_STATE_MASK           0x000CU
#define TCPC_CC_STATUS_CC1_STATE_MSB            1U
#define TCPC_CC_STATUS_CC1_STATE_LSB            0U
#define TCPC_CC_STATUS_CC1_STATE_MASK           0x0003U

/* POWER_STATUS : */
#define TCPC_POWER_STATUS_IDX                                 0x1EU
#define TCPC_POWER_STATUS_DEBUG_ACCESSORY_CONNECTED_MSB       7U
#define TCPC_POWER_STATUS_DEBUG_ACCESSORY_CONNECTED_LSB       7U
#define TCPC_POWER_STATUS_DEBUG_ACCESSORY_CONNECTED_MASK      0x0080U
#define TCPC_POWER_STATUS_TCPC_INITIALIZATION_STATUS_MSB      6U
#define TCPC_POWER_STATUS_TCPC_INITIALIZATION_STATUS_LSB      6U
#define TCPC_POWER_STATUS_TCPC_INITIALIZATION_STATUS_MASK     0x0040U
#define TCPC_POWER_STATUS_SOURCING_HIGH_VOLTAGE_MSB           5U
#define TCPC_POWER_STATUS_SOURCING_HIGH_VOLTAGE_LSB           5U
#define TCPC_POWER_STATUS_SOURCING_HIGH_VOLTAGE_MASK          0x0020U
#define TCPC_POWER_STATUS_SOURCING_VBUS_MSB                   4U
#define TCPC_POWER_STATUS_SOURCING_VBUS_LSB                   4U
#define TCPC_POWER_STATUS_SOURCING_VBUS_MASK                  0x0010U
#define TCPC_POWER_STATUS_VBUS_PRESENT_DETECTION_ENABLED_MSB  3U
#define TCPC_POWER_STATUS_VBUS_PRESENT_DETECTION_ENABLED_LSB  3U
#define TCPC_POWER_STATUS_VBUS_PRESENT_DETECTION_ENABLED_MASK 0x0008U
#define TCPC_POWER_STATUS_VBUS_PRESENT_MSB                    2U
#define TCPC_POWER_STATUS_VBUS_PRESENT_LSB                    2U
#define TCPC_POWER_STATUS_VBUS_PRESENT_MASK                   0x0004U
#define TCPC_POWER_STATUS_VCONN_PRESENT_MSB                   1U
#define TCPC_POWER_STATUS_VCONN_PRESENT_LSB                   1U
#define TCPC_POWER_STATUS_VCONN_PRESENT_MASK                  0x0002U
#define TCPC_POWER_STATUS_SINKING_VBUS_MSB                    0U
#define TCPC_POWER_STATUS_SINKING_VBUS_LSB                    0U
#define TCPC_POWER_STATUS_SINKING_VBUS_MASK                   0x0001U

/* FAULT_STATUS : */
#define TCPC_FAULT_STATUS_IDX                                                          0x1FU
#define TCPC_FAULT_STATUS_ALL_REGISTERS_RESET_TO_DEFAULT_INTERRUPT_STATUS_MSB          7U
#define TCPC_FAULT_STATUS_ALL_REGISTERS_RESET_TO_DEFAULT_INTERRUPT_STATUS_LSB          7U
#define TCPC_FAULT_STATUS_ALL_REGISTERS_RESET_TO_DEFAULT_INTERRUPT_STATUS_MASK         0x0080U
#define TCPC_FAULT_STATUS_FORCE_OFF_VBUS_STATUS_MSB                                    6U
#define TCPC_FAULT_STATUS_FORCE_OFF_VBUS_STATUS_LSB                                    6U
#define TCPC_FAULT_STATUS_FORCE_OFF_VBUS_STATUS_MASK                                   0x0040U
#define TCPC_FAULT_STATUS_AUTO_DISCHARGE_FAILED_MSB                                    5U
#define TCPC_FAULT_STATUS_AUTO_DISCHARGE_FAILED_LSB                                    5U
#define TCPC_FAULT_STATUS_AUTO_DISCHARGE_FAILED_MASK                                   0x0020U
#define TCPC_FAULT_STATUS_FORCE_DISCHARGE_FAILED_MSB                                   4U
#define TCPC_FAULT_STATUS_FORCE_DISCHARGE_FAILED_LSB                                   4U
#define TCPC_FAULT_STATUS_FORCE_DISCHARGE_FAILED_MASK                                  0x0010U
#define TCPC_FAULT_STATUS_INTERNAL_OR_EXTERNAL_VBUS_OVER_CURRENT_PROTECTION_FAULT_MSB  3U
#define TCPC_FAULT_STATUS_INTERNAL_OR_EXTERNAL_VBUS_OVER_CURRENT_PROTECTION_FAULT_LSB  3U
#define TCPC_FAULT_STATUS_INTERNAL_OR_EXTERNAL_VBUS_OVER_CURRENT_PROTECTION_FAULT_MASK 0x0008U
#define TCPC_FAULT_STATUS_INTERNAL_OR_EXTERNAL_VBUS_OVER_VOLTAGE_PROTECTION_FAULT_MSB  2U
#define TCPC_FAULT_STATUS_INTERNAL_OR_EXTERNAL_VBUS_OVER_VOLTAGE_PROTECTION_FAULT_LSB  2U
#define TCPC_FAULT_STATUS_INTERNAL_OR_EXTERNAL_VBUS_OVER_VOLTAGE_PROTECTION_FAULT_MASK 0x0004U
#define TCPC_FAULT_STATUS_VCONN_OVER_CURRENT_FAULT_MSB                                 1U
#define TCPC_FAULT_STATUS_VCONN_OVER_CURRENT_FAULT_LSB                                 1U
#define TCPC_FAULT_STATUS_VCONN_OVER_CURRENT_FAULT_MASK                                0x0002U
#define TCPC_FAULT_STATUS_I2_C_INTERFACE_ERROR_MSB                                     0U
#define TCPC_FAULT_STATUS_I2_C_INTERFACE_ERROR_LSB                                     0U
#define TCPC_FAULT_STATUS_I2_C_INTERFACE_ERROR_MASK                                    0x0001U

