nxp-appcodehub/dm-power-delivery-frdm-a-s32k344/src/drivers/inc/ptn5110_register.h
/* EXTENDED_STATUS :*/
#define TCPC_EXTENDED_STATUS_IDX         0x20U
#define TCPC_EXTENDED_STATUS_POR         0x00U
#define TCPC_EXTENDED_STATUS_VSAFE0_MSB  0U
#define TCPC_EXTENDED_STATUS_VSAFE0_LSB  0U
#define TCPC_EXTENDED_STATUS_VSAFE0_MASK 0x01U

/* ALERT_EXTENDED :*/
#define TCPC_ALERT_EXTENDED_IDX                        0x21U
#define TCPC_ALERT_EXTENDED_POR                        0x00U
#define TCPC_ALERT_EXTENDED_TIMER_EXPIRED_MSB          2U
#define TCPC_ALERT_EXTENDED_TIMER_EXPIRED_LSB          2U
#define TCPC_ALERT_EXTENDED_TIMER_EXPIRED_MASK         0x04U
#define TCPC_ALERT_EXTENDED_SOURCE_FAST_ROLE_SWAP_MSB  1U
#define TCPC_ALERT_EXTENDED_SOURCE_FAST_ROLE_SWAP_LSB  1U
#define TCPC_ALERT_EXTENDED_SOURCE_FAST_ROLE_SWAP_MASK 0x02U
#define TCPC_ALERT_EXTENDED_SINK_FAST_ROLE_SWAP_MSB    0U
#define TCPC_ALERT_EXTENDED_SINK_FAST_ROLE_SWAP_LSB    0U
#define TCPC_ALERT_EXTENDED_SINK_FAST_ROLE_SWAP_MASK   0x01U

/* COMMAND : */
#define TCPC_COMMAND_IDX 0x23U

/* DEVICE_CAPABILITIES_1 : */
#define TCPC_DEVICE_CAPABILITIES_1_IDX                                     0x24U
#define TCPC_DEVICE_CAPABILITIES_1_VBUS_HIGH_VOLTAGE_TARGET_MSB            15U
#define TCPC_DEVICE_CAPABILITIES_1_VBUS_HIGH_VOLTAGE_TARGET_LSB            15U
#define TCPC_DEVICE_CAPABILITIES_1_VBUS_HIGH_VOLTAGE_TARGET_MASK           0x8000U
#define TCPC_DEVICE_CAPABILITIES_1_VBUS_OCP_REPORTING_MSB                  14U
#define TCPC_DEVICE_CAPABILITIES_1_VBUS_OCP_REPORTING_LSB                  14U
#define TCPC_DEVICE_CAPABILITIES_1_VBUS_OCP_REPORTING_MASK                 0x4000U
#define TCPC_DEVICE_CAPABILITIES_1_VBUS_OVP_REPORTING_MSB                  13U
#define TCPC_DEVICE_CAPABILITIES_1_VBUS_OVP_REPORTING_LSB                  13U
#define TCPC_DEVICE_CAPABILITIES_1_VBUS_OVP_REPORTING_MASK                 0x2000U
#define TCPC_DEVICE_CAPABILITIES_1_BLEED_DISCHARGE_MSB                     12U
#define TCPC_DEVICE_CAPABILITIES_1_BLEED_DISCHARGE_LSB                     12U
#define TCPC_DEVICE_CAPABILITIES_1_BLEED_DISCHARGE_MASK                    0x1000U
#define TCPC_DEVICE_CAPABILITIES_1_FORCE_DISCHARGE_MSB                     11U
#define TCPC_DEVICE_CAPABILITIES_1_FORCE_DISCHARGE_LSB                     11U
#define TCPC_DEVICE_CAPABILITIES_1_FORCE_DISCHARGE_MASK                    0x0800U
#define TCPC_DEVICE_CAPABILITIES_1_VBUS_MEASUREMENT_AND_ALARM_CAPABLE_MSB  10U
#define TCPC_DEVICE_CAPABILITIES_1_VBUS_MEASUREMENT_AND_ALARM_CAPABLE_LSB  10U
#define TCPC_DEVICE_CAPABILITIES_1_VBUS_MEASUREMENT_AND_ALARM_CAPABLE_MASK 0x0400U
#define TCPC_DEVICE_CAPABILITIES_1_SOURCE_RESISTOR_SUPPORTED_MSB           9U
#define TCPC_DEVICE_CAPABILITIES_1_SOURCE_RESISTOR_SUPPORTED_LSB           8U
#define TCPC_DEVICE_CAPABILITIES_1_SOURCE_RESISTOR_SUPPORTED_MASK          0x0300U
#define TCPC_DEVICE_CAPABILITIES_1_ROLES_SUPPORTED_MSB                     7U
#define TCPC_DEVICE_CAPABILITIES_1_ROLES_SUPPORTED_LSB                     5U
#define TCPC_DEVICE_CAPABILITIES_1_ROLES_SUPPORTED_MASK                    0x00E0U
#define TCPC_DEVICE_CAPABILITIES_1_SOP_DBGSOP_DBG_SUPPORT_MSB              4U
#define TCPC_DEVICE_CAPABILITIES_1_SOP_DBGSOP_DBG_SUPPORT_LSB              4U
#define TCPC_DEVICE_CAPABILITIES_1_SOP_DBGSOP_DBG_SUPPORT_MASK             0x0010U
#define TCPC_DEVICE_CAPABILITIES_1_SOURCE_VCONN_MSB                        3U
#define TCPC_DEVICE_CAPABILITIES_1_SOURCE_VCONN_LSB                        3U
#define TCPC_DEVICE_CAPABILITIES_1_SOURCE_VCONN_MASK                       0x0008U
#define TCPC_DEVICE_CAPABILITIES_1_SINK_VBUS_MSB                           2U
#define TCPC_DEVICE_CAPABILITIES_1_SINK_VBUS_LSB                           2U
#define TCPC_DEVICE_CAPABILITIES_1_SINK_VBUS_MASK                          0x0004U
#define TCPC_DEVICE_CAPABILITIES_1_SOURCE_HIGH_VOLTAGE_VBUS_MSB            1U
#define TCPC_DEVICE_CAPABILITIES_1_SOURCE_HIGH_VOLTAGE_VBUS_LSB            1U
#define TCPC_DEVICE_CAPABILITIES_1_SOURCE_HIGH_VOLTAGE_VBUS_MASK           0x0002U
#define TCPC_DEVICE_CAPABILITIES_1_SOURCE_VBUS_MSB                         0U
#define TCPC_DEVICE_CAPABILITIES_1_SOURCE_VBUS_LSB                         0U
#define TCPC_DEVICE_CAPABILITIES_1_SOURCE_VBUS_MASK                        0x0001U

/* DEVICE_CAPABILITIES_2 : */
#define TCPC_DEVICE_CAPABILITIES_2_IDX                                  0x26U
#define TCPC_DEVICE_CAPABILITIES_2_GENERIC_TIMER_MSB                    13U
#define TCPC_DEVICE_CAPABILITIES_2_GENERIC_TIMER_LSB                    13U
#define TCPC_DEVICE_CAPABILITIES_2_GENERIC_TIMER_MASK                   0x2000U
#define TCPC_DEVICE_CAPABILITIES_2_LONG_MESSAGE_MSB                     12U
#define TCPC_DEVICE_CAPABILITIES_2_LONG_MESSAGE_LSB                     12U
#define TCPC_DEVICE_CAPABILITIES_2_LONG_MESSAGE_MASK                    0x1000U
#define TCPC_DEVICE_CAPABILITIES_2_SMBUS_PEC_MSB                        11U
#define TCPC_DEVICE_CAPABILITIES_2_SMBUS_PEC_LSB                        11U
#define TCPC_DEVICE_CAPABILITIES_2_SMBUS_PEC_MASK                       0x0800U
#define TCPC_DEVICE_CAPABILITIES_2_SOURCE_FR_SWAP_MSB                   10U
#define TCPC_DEVICE_CAPABILITIES_2_SOURCE_FR_SWAP_LSB                   10U
#define TCPC_DEVICE_CAPABILITIES_2_SOURCE_FR_SWAP_MASK                  0x0400U
#define TCPC_DEVICE_CAPABILITIES_2_SINK_FR_SWAP_MSB                     9U
#define TCPC_DEVICE_CAPABILITIES_2_SINK_FR_SWAP_LSB                     9U
#define TCPC_DEVICE_CAPABILITIES_2_SINK_FR_SWAP_MASK                    0x0200U
#define TCPC_DEVICE_CAPABILITIES_2_WATCHDOG_TIMER_MSB                   8U
#define TCPC_DEVICE_CAPABILITIES_2_WATCHDOG_TIMER_LSB                   8U
#define TCPC_DEVICE_CAPABILITIES_2_WATCHDOG_TIMER_MASK                  0x0100U
#define TCPC_DEVICE_CAPABILITIES_2_SINK_DISCONNECT_DETECTION_MSB        7U
#define TCPC_DEVICE_CAPABILITIES_2_SINK_DISCONNECT_DETECTION_LSB        7U
#define TCPC_DEVICE_CAPABILITIES_2_SINK_DISCONNECT_DETECTION_MASK       0x0080U
#define TCPC_DEVICE_CAPABILITIES_2_STOP_DISCHARGE_THRESHOLD_MSB         6U
#define TCPC_DEVICE_CAPABILITIES_2_STOP_DISCHARGE_THRESHOLD_LSB         6U
#define TCPC_DEVICE_CAPABILITIES_2_STOP_DISCHARGE_THRESHOLD_MASK        0x0040U
#define TCPC_DEVICE_CAPABILITIES_2_VBUS_VOLTAGE_ALARM_LSB_MSB           5U
#define TCPC_DEVICE_CAPABILITIES_2_VBUS_VOLTAGE_ALARM_LSB_LSB           4U
#define TCPC_DEVICE_CAPABILITIES_2_VBUS_VOLTAGE_ALARM_LSB_MASK          0x0030U
#define TCPC_DEVICE_CAPABILITIES_2_VCONN_POWER_SUPPORTED_MSB            3U
#define TCPC_DEVICE_CAPABILITIES_2_VCONN_POWER_SUPPORTED_LSB            1U
#define TCPC_DEVICE_CAPABILITIES_2_VCONN_POWER_SUPPORTED_MASK           0x000EU
#define TCPC_DEVICE_CAPABILITIES_2_VCONN_OVERCURRENT_FAULT_CAPABLE_MSB  0U
#define TCPC_DEVICE_CAPABILITIES_2_VCONN_OVERCURRENT_FAULT_CAPABLE_LSB  0U
#define TCPC_DEVICE_CAPABILITIES_2_VCONN_OVERCURRENT_FAULT_CAPABLE_MASK 0x0001U

/* STANDARD_INPUT_CAPABILITIES : */
#define TCPC_STANDARD_INPUT_CAPABILITIES_IDX                                           0x28U
#define TCPC_STANDARD_INPUT_CAPABILITIES_SOURCE_FAST_ROLE_SWAP_MSB                     4U
#define TCPC_STANDARD_INPUT_CAPABILITIES_SOURCE_FAST_ROLE_SWAP_LSB                     3U
#define TCPC_STANDARD_INPUT_CAPABILITIES_SOURCE_FAST_ROLE_SWAP_MASK                    0x0018U
#define TCPC_STANDARD_INPUT_CAPABILITIES_VBUS_EXTERNAL_OVER_VOLTAGE_FAULT_CAPABLE_MSB  2U
#define TCPC_STANDARD_INPUT_CAPABILITIES_VBUS_EXTERNAL_OVER_VOLTAGE_FAULT_CAPABLE_LSB  2U
#define TCPC_STANDARD_INPUT_CAPABILITIES_VBUS_EXTERNAL_OVER_VOLTAGE_FAULT_CAPABLE_MASK 0x0004U
#define TCPC_STANDARD_INPUT_CAPABILITIES_VBUS_EXTERNAL_OVER_CURRENT_FAULT_CAPABLE_MSB  1U
#define TCPC_STANDARD_INPUT_CAPABILITIES_VBUS_EXTERNAL_OVER_CURRENT_FAULT_CAPABLE_LSB  1U
#define TCPC_STANDARD_INPUT_CAPABILITIES_VBUS_EXTERNAL_OVER_CURRENT_FAULT_CAPABLE_MASK 0x0002U
#define TCPC_STANDARD_INPUT_CAPABILITIES_FORCE_OFF_VBUS_CAPABLE_MSB                    0U
#define TCPC_STANDARD_INPUT_CAPABILITIES_FORCE_OFF_VBUS_CAPABLE_LSB                    0U
#define TCPC_STANDARD_INPUT_CAPABILITIES_FORCE_OFF_VBUS_CAPABLE_MASK                   0x0001U

