nxp-appcodehub/dm-power-delivery-frdm-a-s32k344/src/drivers/inc/ptn5110_register.h
/* STANDARD_OUTPUT_CAPABILITIES : */
#define TCPC_STANDARD_OUTPUT_CAPABILITIES_IDX                                        0x29U
#define TCPC_STANDARD_OUTPUT_CAPABILITIES_VBUS_SINK_DISCONNECT_DETECT_INDICATOR_MSB  7U
#define TCPC_STANDARD_OUTPUT_CAPABILITIES_VBUS_SINK_DISCONNECT_DETECT_INDICATOR_LSB  7U
#define TCPC_STANDARD_OUTPUT_CAPABILITIES_VBUS_SINK_DISCONNECT_DETECT_INDICATOR_MASK 0x0080U
#define TCPC_STANDARD_OUTPUT_CAPABILITIES_DEBUG_ACCESSORY_INDICATOR_MSB              6U
#define TCPC_STANDARD_OUTPUT_CAPABILITIES_DEBUG_ACCESSORY_INDICATOR_LSB              6U
#define TCPC_STANDARD_OUTPUT_CAPABILITIES_DEBUG_ACCESSORY_INDICATOR_MASK             0x0040U
#define TCPC_STANDARD_OUTPUT_CAPABILITIES_VBUS_PRESENT_MONITOR_MSB                   5U
#define TCPC_STANDARD_OUTPUT_CAPABILITIES_VBUS_PRESENT_MONITOR_LSB                   5U
#define TCPC_STANDARD_OUTPUT_CAPABILITIES_VBUS_PRESENT_MONITOR_MASK                  0x0020U
#define TCPC_STANDARD_OUTPUT_CAPABILITIES_AUDIO_ADAPTER_ACCESSORY_INDICATOR_MSB      4U
#define TCPC_STANDARD_OUTPUT_CAPABILITIES_AUDIO_ADAPTER_ACCESSORY_INDICATOR_LSB      4U
#define TCPC_STANDARD_OUTPUT_CAPABILITIES_AUDIO_ADAPTER_ACCESSORY_INDICATOR_MASK     0x0010U
#define TCPC_STANDARD_OUTPUT_CAPABILITIES_ACTIVE_CABLE_INDICATOR_MSB                 3U
#define TCPC_STANDARD_OUTPUT_CAPABILITIES_ACTIVE_CABLE_INDICATOR_LSB                 3U
#define TCPC_STANDARD_OUTPUT_CAPABILITIES_ACTIVE_CABLE_INDICATOR_MASK                0x0008U
#define TCPC_STANDARD_OUTPUT_CAPABILITIES_MUX_CONFIGURATION_CONTROL_MSB              2U
#define TCPC_STANDARD_OUTPUT_CAPABILITIES_MUX_CONFIGURATION_CONTROL_LSB              2U
#define TCPC_STANDARD_OUTPUT_CAPABILITIES_MUX_CONFIGURATION_CONTROL_MASK             0x0004U
#define TCPC_STANDARD_OUTPUT_CAPABILITIES_CONNECTION_PRESENT_INDICATOR_MSB           1U
#define TCPC_STANDARD_OUTPUT_CAPABILITIES_CONNECTION_PRESENT_INDICATOR_LSB           1U
#define TCPC_STANDARD_OUTPUT_CAPABILITIES_CONNECTION_PRESENT_INDICATOR_MASK          0x0002U
#define TCPC_STANDARD_OUTPUT_CAPABILITIES_CONNECTOR_ORIENTATION_MSB                  0U
#define TCPC_STANDARD_OUTPUT_CAPABILITIES_CONNECTOR_ORIENTATION_LSB                  0U
#define TCPC_STANDARD_OUTPUT_CAPABILITIES_CONNECTOR_ORIENTATION_MASK                 0x0001U

/* CONFIGURE_ENTENDED1 */
#define TCPC_CONFIGURE_EXTENDED1_IDX                                0x2AU
#define TCPC_CONFIGURE_EXTENDED1_POR                                0x00U
#define TCPC_CONFIGURE_EXTENDED1_FR_SWAP_BIDIRECTIONAL_PIN_MSB      1U
#define TCPC_CONFIGURE_EXTENDED1_FR_SWAP_BIDIRECTIONAL_PIN_LSB      1U
#define TCPC_CONFIGURE_EXTENDED1_FR_SWAP_BIDIRECTIONAL_PIN_MASK     0x0002U
#define TCPC_CONFIGURE_EXTENDED1_STANDARD_INPUT_SOURCE_FR_SWAP_MSB  0U
#define TCPC_CONFIGURE_EXTENDED1_STANDARD_INPUT_SOURCE_FR_SWAP_LSB  0U
#define TCPC_CONFIGURE_EXTENDED1_STANDARD_INPUT_SOURCE_FR_SWAP_MASK 0x0001U

/* GENERIC_TIMER : */
#define TCPC_GENERIC_TIMER_IDX 0x2CU

/* MESSAGE_HEADER_INFO : */
#define TCPC_MESSAGE_HEADER_INFO_IDX                                0x2EU
#define TCPC_MESSAGE_HEADER_INFO_CABLE_PLUG_MSB                     4U
#define TCPC_MESSAGE_HEADER_INFO_CABLE_PLUG_LSB                     4U
#define TCPC_MESSAGE_HEADER_INFO_CABLE_PLUG_MASK                    0x0010U
#define TCPC_MESSAGE_HEADER_INFO_DATA_ROLE_MSB                      3U
#define TCPC_MESSAGE_HEADER_INFO_DATA_ROLE_LSB                      3U
#define TCPC_MESSAGE_HEADER_INFO_DATA_ROLE_MASK                     0x0008U
#define TCPC_MESSAGE_HEADER_INFO_USB_PD_SPECIFICATION_REVISION_MSB  2U
#define TCPC_MESSAGE_HEADER_INFO_USB_PD_SPECIFICATION_REVISION_LSB  1U
#define TCPC_MESSAGE_HEADER_INFO_USB_PD_SPECIFICATION_REVISION_MASK 0x0006U
#define TCPC_MESSAGE_HEADER_INFO_POWER_ROLE_MSB                     0U
#define TCPC_MESSAGE_HEADER_INFO_POWER_ROLE_LSB                     0U
#define TCPC_MESSAGE_HEADER_INFO_POWER_ROLE_MASK                    0x0001U

/* RECEIVE_DETECT : */
#define TCPC_RECEIVE_DETECT_IDX                            0x2FU
#define TCPC_RECEIVE_DETECT_ENABLE_CABLE_RESET_MSB         6U
#define TCPC_RECEIVE_DETECT_ENABLE_CABLE_RESET_LSB         6U
#define TCPC_RECEIVE_DETECT_ENABLE_CABLE_RESET_MASK        0x0040U
#define TCPC_RECEIVE_DETECT_ENABLE_HARD_RESET_MSB          5U
#define TCPC_RECEIVE_DETECT_ENABLE_HARD_RESET_LSB          5U
#define TCPC_RECEIVE_DETECT_ENABLE_HARD_RESET_MASK         0x0020U
#define TCPC_RECEIVE_DETECT_ENABLE_SOP_DBG_PP_MESSAGE_MSB  4U
#define TCPC_RECEIVE_DETECT_ENABLE_SOP_DBG_PP_MESSAGE_LSB  4U
#define TCPC_RECEIVE_DETECT_ENABLE_SOP_DBG_PP_MESSAGE_MASK 0x0010U
#define TCPC_RECEIVE_DETECT_ENABLE_SOP_DBG_P_MESSAGE_MSB   3U
#define TCPC_RECEIVE_DETECT_ENABLE_SOP_DBG_P_MESSAGE_LSB   3U
#define TCPC_RECEIVE_DETECT_ENABLE_SOP_DBG_P_MESSAGE_MASK  0x0008U
#define TCPC_RECEIVE_DETECT_ENABLE_SOP_PP_MESSAGE_MSB      2U
#define TCPC_RECEIVE_DETECT_ENABLE_SOP_PP_MESSAGE_LSB      2U
#define TCPC_RECEIVE_DETECT_ENABLE_SOP_PP_MESSAGE_MASK     0x0004U
#define TCPC_RECEIVE_DETECT_ENABLE_SOP_P_MESSAGE_MSB       1U
#define TCPC_RECEIVE_DETECT_ENABLE_SOP_P_MESSAGE_LSB       1U
#define TCPC_RECEIVE_DETECT_ENABLE_SOP_P_MESSAGE_MASK      0x0002U
#define TCPC_RECEIVE_DETECT_ENABLE_SOP_MESSAGE_MSB         0U
#define TCPC_RECEIVE_DETECT_ENABLE_SOP_MESSAGE_LSB         0U
#define TCPC_RECEIVE_DETECT_ENABLE_SOP_MESSAGE_MASK        0x0001U

/* RECEIVE_BYTE_COUNT : */
#define TCPC_RECEIVE_BYTE_COUNT_IDX 0x30U

/* RX_BUF_FRAME_TYPE : */
#define TCPC_RX_BUF_FRAME_TYPE_IDX                       0x31U
#define TCPC_RX_BUF_FRAME_TYPE_RECEIVED_SOP_MESSAGE_MSB  2U
#define TCPC_RX_BUF_FRAME_TYPE_RECEIVED_SOP_MESSAGE_LSB  0U
#define TCPC_RX_BUF_FRAME_TYPE_RECEIVED_SOP_MESSAGE_MASK 0x0007U

/* RX_BUF_HEADER : */
#define TCPC_RX_BUF_HEADER_IDX                           0x32U
#define TCPC_RX_BUF_HEADER_RX_EXTENDED_MSB               15U
#define TCPC_RX_BUF_HEADER_RX_EXTENDED_LSB               15U
#define TCPC_RX_BUF_HEADER_RX_EXTENDED_MASK              0x8000U
#define TCPC_RX_BUF_HEADER_RX_NUMBER_OF_DATA_OBJECT_MSB  14U
#define TCPC_RX_BUF_HEADER_RX_NUMBER_OF_DATA_OBJECT_LSB  12U
#define TCPC_RX_BUF_HEADER_RX_NUMBER_OF_DATA_OBJECT_MASK 0x7000U
#define TCPC_RX_BUF_HEADER_RX_MESSAGE_ID_MSB             11U
#define TCPC_RX_BUF_HEADER_RX_MESSAGE_ID_LSB             9U
#define TCPC_RX_BUF_HEADER_RX_MESSAGE_ID_MASK            0x0E00U
#define TCPC_RX_BUF_HEADER_RX_PORT_POWER_ROLE_MSB        8U
#define TCPC_RX_BUF_HEADER_RX_PORT_POWER_ROLE_LSB        8U
#define TCPC_RX_BUF_HEADER_RX_PORT_POWER_ROLE_MASK       0x0100U
#define TCPC_RX_BUF_HEADER_RX_SPEC_REVISION_MSB          7U
#define TCPC_RX_BUF_HEADER_RX_SPEC_REVISION_LSB          6U
#define TCPC_RX_BUF_HEADER_RX_SPEC_REVISION_MASK         0x00C0U
#define TCPC_RX_BUF_HEADER_RX_PORT_DATA_ROLE_MSB         5U
#define TCPC_RX_BUF_HEADER_RX_PORT_DATA_ROLE_LSB         5U
#define TCPC_RX_BUF_HEADER_RX_PORT_DATA_ROLE_MASK        0x0020U
#define TCPC_RX_BUF_HEADER_RX_MESSAGE_TYPE_MSB           4U
#define TCPC_RX_BUF_HEADER_RX_MESSAGE_TYPE_LSB           0U
#define TCPC_RX_BUF_HEADER_RX_MESSAGE_TYPE_MASK          0x001FU

/* RX_BUF_OBJ1 : */
#define TCPC_RX_BUF_OBJ1_IDX 0x34U

