nxp-appcodehub/dm-power-delivery-frdm-a-s32k344/src/drivers/inc/ptn5110_register.h
#define TCPC_RX_BUF_EXT_HDR_IDX             0x34U
#define TCPC_RX_BUF_EXT_HDR_RX_CHUNKED_MSB  15U
#define TCPC_RX_BUF_EXT_HDR_RX_CHUNKED_LSB  15U
#define TCPC_RX_BUF_EXT_HDR_RX_CHUNKED_MASK 0x8000U

/* RX_BUF_OBJ2 : */
#define TCPC_RX_BUF_OBJ2_IDX 0x38U

/* RX_BUF_OBJ3 : */
#define TCPC_RX_BUF_OBJ3_IDX 0x3CU

/* RX_BUF_OBJ4 : */
#define TCPC_RX_BUF_OBJ4_IDX 0x40U

/* RX_BUF_OBJ5 : */
#define TCPC_RX_BUF_OBJ5_IDX 0x44U

/* RX_BUF_OBJ6 : */
#define TCPC_RX_BUF_OBJ6_IDX 0x48U

/* RX_BUF_OBJ7 : */
#define TCPC_RX_BUF_OBJ7_IDX 0x4CU

/* TRANSMIT : */
#define TCPC_TRANSMIT_IDX                       0x50U
#define TCPC_TRANSMIT_RETRY_COUNTER_MSB         5U
#define TCPC_TRANSMIT_RETRY_COUNTER_LSB         4U
#define TCPC_TRANSMIT_RETRY_COUNTER_MASK        0x0030U
#define TCPC_TRANSMIT_TRANSMIT_SOP_MESSAGE_MSB  2U
#define TCPC_TRANSMIT_TRANSMIT_SOP_MESSAGE_LSB  0U
#define TCPC_TRANSMIT_TRANSMIT_SOP_MESSAGE_MASK 0x0007U

/* TRANSMIT_BYTE_COUNT : */
#define TCPC_TRANSMIT_BYTE_COUNT_IDX 0x51U

/* TX_BUF_HEADER : */
#define TCPC_TX_BUF_HEADER_IDX                           0x52U
#define TCPC_TX_BUF_HEADER_TX_EXTENDED_MSB               15U
#define TCPC_TX_BUF_HEADER_TX_EXTENDED_LSB               15U
#define TCPC_TX_BUF_HEADER_TX_EXTENDED_MASK              0x8000U
#define TCPC_TX_BUF_HEADER_TX_NUMBER_OF_DATA_OBJECT_MSB  14U
#define TCPC_TX_BUF_HEADER_TX_NUMBER_OF_DATA_OBJECT_LSB  12U
#define TCPC_TX_BUF_HEADER_TX_NUMBER_OF_DATA_OBJECT_MASK 0x7000U
#define TCPC_TX_BUF_HEADER_TX_MESSAGE_ID_MSB             11U
#define TCPC_TX_BUF_HEADER_TX_MESSAGE_ID_LSB             9U
#define TCPC_TX_BUF_HEADER_TX_MESSAGE_ID_MASK            0x0E00U
#define TCPC_TX_BUF_HEADER_TX_PORT_POWER_ROLE_MSB        8U
#define TCPC_TX_BUF_HEADER_TX_PORT_POWER_ROLE_LSB        8U
#define TCPC_TX_BUF_HEADER_TX_PORT_POWER_ROLE_MASK       0x0100U
#define TCPC_TX_BUF_HEADER_TX_SPEC_REVISION_MSB          7U
#define TCPC_TX_BUF_HEADER_TX_SPEC_REVISION_LSB          6U
#define TCPC_TX_BUF_HEADER_TX_SPEC_REVISION_MASK         0x00C0U
#define TCPC_TX_BUF_HEADER_TX_PORT_DATA_ROLE_MSB         5U
#define TCPC_TX_BUF_HEADER_TX_PORT_DATA_ROLE_LSB         5U
#define TCPC_TX_BUF_HEADER_TX_PORT_DATA_ROLE_MASK        0x0020U
#define TCPC_TX_BUF_HEADER_TX_MESSAGE_TYPE_MSB           4U
#define TCPC_TX_BUF_HEADER_TX_MESSAGE_TYPE_LSB           0U
#define TCPC_TX_BUF_HEADER_TX_MESSAGE_TYPE_MASK          0x001FU

/* TX_BUF_OBJ1 : */
#define TCPC_TX_BUF_OBJ1_IDX 0x54U

/* TX_BUF_OBJ2 : */
#define TCPC_TX_BUF_OBJ2_IDX 0x58U

/* TX_BUF_OBJ3 : */
#define TCPC_TX_BUF_OBJ3_IDX 0x5CU

/* TX_BUF_OBJ4 : */
#define TCPC_TX_BUF_OBJ4_IDX 0x60U

/* TX_BUF_OBJ5 : */
#define TCPC_TX_BUF_OBJ5_IDX 0x64U

/* TX_BUF_OBJ6 : */
#define TCPC_TX_BUF_OBJ6_IDX 0x68U

/* TX_BUF_OBJ7 : */
#define TCPC_TX_BUF_OBJ7_IDX 0x6CU

/* VBUS_VOLTAGE : */
#define TCPC_VBUS_VOLTAGE_IDX                           0x70U
#define TCPC_VBUS_VOLTAGE_VBUS_SCALE_FACTOR_MSB         11U
#define TCPC_VBUS_VOLTAGE_VBUS_SCALE_FACTOR_LSB         10U
#define TCPC_VBUS_VOLTAGE_VBUS_SCALE_FACTOR_MASK        0x0C00U
#define TCPC_VBUS_VOLTAGE_VBUS_VOLTAGE_MEASUREMENT_MSB  9U
#define TCPC_VBUS_VOLTAGE_VBUS_VOLTAGE_MEASUREMENT_LSB  0U
#define TCPC_VBUS_VOLTAGE_VBUS_VOLTAGE_MEASUREMENT_MASK 0x03FFU

/* VBUS_SINK_DISCONNECT_THRESHOLD : */
#define TCPC_VBUS_SINK_DISCONNECT_THRESHOLD_IDX                                  0x72U
#define TCPC_VBUS_SINK_DISCONNECT_THRESHOLD_VBUS_SINK_DISCONNECT_TRIP_POINT_MSB  9U
#define TCPC_VBUS_SINK_DISCONNECT_THRESHOLD_VBUS_SINK_DISCONNECT_TRIP_POINT_LSB  0U
#define TCPC_VBUS_SINK_DISCONNECT_THRESHOLD_VBUS_SINK_DISCONNECT_TRIP_POINT_MASK 0x03FFU

/* VBUS_STOP_DISCHARGE_THRESHOLD : */
#define TCPC_VBUS_STOP_DISCHARGE_THRESHOLD_IDX                                 0x74U
#define TCPC_VBUS_STOP_DISCHARGE_THRESHOLD_VBUS_STOP_DISCHARGE_TRIP_POINT_MSB  9U
#define TCPC_VBUS_STOP_DISCHARGE_THRESHOLD_VBUS_STOP_DISCHARGE_TRIP_POINT_LSB  0U
#define TCPC_VBUS_STOP_DISCHARGE_THRESHOLD_VBUS_STOP_DISCHARGE_TRIP_POINT_MASK 0x03FFU

/* VBUS_VOLTAGE_ALARM_HI_CFG : */
#define TCPC_VBUS_VOLTAGE_ALARM_HI_CFG_IDX                             0x76U
#define TCPC_VBUS_VOLTAGE_ALARM_HI_CFG_VBUS_LO_VOLTAGE_TRIP_POINT_MSB  9U
#define TCPC_VBUS_VOLTAGE_ALARM_HI_CFG_VBUS_LO_VOLTAGE_TRIP_POINT_LSB  0U
#define TCPC_VBUS_VOLTAGE_ALARM_HI_CFG_VBUS_LO_VOLTAGE_TRIP_POINT_MASK 0x03FFU

/* VBUS_VOLTAGE_ALARM_LO_CFG : */
#define TCPC_VBUS_VOLTAGE_ALARM_LO_CFG_IDX                             0x78U
#define TCPC_VBUS_VOLTAGE_ALARM_LO_CFG_VBUS_HI_VOLTAGE_TRIP_POINT_MSB  9U
#define TCPC_VBUS_VOLTAGE_ALARM_LO_CFG_VBUS_HI_VOLTAGE_TRIP_POINT_LSB  0U
#define TCPC_VBUS_VOLTAGE_ALARM_LO_CFG_VBUS_HI_VOLTAGE_TRIP_POINT_MASK 0x03FFU

/*/ PTN5110 */

/* EXT_ALERT : */
#define PTN5110_EXT_ALERT_IDX                                       0x82U
#define PTN5110_EXT_ALERT_GPIO_STATUS_CHANGE_MSB                    7U
#define PTN5110_EXT_ALERT_GPIO_STATUS_CHANGE_LSB                    7U
#define PTN5110_EXT_ALERT_GPIO_STATUS_CHANGE_MASK                   0x0080U
#define PTN5110_EXT_ALERT_EXTENDED_TX_DATA_LOSS_MSB                 6U
#define PTN5110_EXT_ALERT_EXTENDED_TX_DATA_LOSS_LSB                 6U
#define PTN5110_EXT_ALERT_EXTENDED_TX_DATA_LOSS_MASK                0x0040U
#define PTN5110_EXT_ALERT_FAST_ROLE_SWAP_VSAFE5V_BEING_SOURCED_MSB  5U
#define PTN5110_EXT_ALERT_FAST_ROLE_SWAP_VSAFE5V_BEING_SOURCED_LSB  5U
#define PTN5110_EXT_ALERT_FAST_ROLE_SWAP_VSAFE5V_BEING_SOURCED_MASK 0x0020U
#define PTN5110_EXT_ALERT_FAST_ROLE_SWAP_REQUEST_RECEIVED_MSB       4U
#define PTN5110_EXT_ALERT_FAST_ROLE_SWAP_REQUEST_RECEIVED_LSB       4U
#define PTN5110_EXT_ALERT_FAST_ROLE_SWAP_REQUEST_RECEIVED_MASK      0x0010U
#define PTN5110_EXT_ALERT_ATOMIC_MESSAGE_SEQUENCE_ALERT_MSB         3U
#define PTN5110_EXT_ALERT_ATOMIC_MESSAGE_SEQUENCE_ALERT_LSB         3U
#define PTN5110_EXT_ALERT_ATOMIC_MESSAGE_SEQUENCE_ALERT_MASK        0x0008U
#define PTN5110_EXT_ALERT_USBC_STATE_CHANGE_MSB                     2U
#define PTN5110_EXT_ALERT_USBC_STATE_CHANGE_LSB                     2U
#define PTN5110_EXT_ALERT_USBC_STATE_CHANGE_MASK                    0x0004U
#define PTN5110_EXT_ALERT_USBC_OUTPUT_CHANGE_MSB                    1U
#define PTN5110_EXT_ALERT_USBC_OUTPUT_CHANGE_LSB                    1U
#define PTN5110_EXT_ALERT_USBC_OUTPUT_CHANGE_MASK                   0x0002U

/* EXT_ALERT_MASK : */
#define PTN5110_EXT_ALERT_MASK_IDX                                                                               0x84U
#define PTN5110_EXT_ALERT_MASK_GPIO_STATUS_CHANGE_MSB                                                            7U
#define PTN5110_EXT_ALERT_MASK_GPIO_STATUS_CHANGE_LSB                                                            7U
#define PTN5110_EXT_ALERT_MASK_GPIO_STATUS_CHANGE_MASK                                                           0x0080U
#define PTN5110_EXT_ALERT_MASK_TRANSMIT_DATA_IN_EXTENDED_MESSAGE_BUFFER_CLEARED_BY_EXTENDED_MESSAGE_RECEIVE_MSB  6U
#define PTN5110_EXT_ALERT_MASK_TRANSMIT_DATA_IN_EXTENDED_MESSAGE_BUFFER_CLEARED_BY_EXTENDED_MESSAGE_RECEIVE_LSB  6U
#define PTN5110_EXT_ALERT_MASK_TRANSMIT_DATA_IN_EXTENDED_MESSAGE_BUFFER_CLEARED_BY_EXTENDED_MESSAGE_RECEIVE_MASK 0x0040U
#define PTN5110_EXT_ALERT_MASK_FAST_ROLE_SWAP_VSAFE5V_BEING_SOURCED_MSB                                          5U
#define PTN5110_EXT_ALERT_MASK_FAST_ROLE_SWAP_VSAFE5V_BEING_SOURCED_LSB                                          5U
#define PTN5110_EXT_ALERT_MASK_FAST_ROLE_SWAP_VSAFE5V_BEING_SOURCED_MASK                                         0x0020U
#define PTN5110_EXT_ALERT_MASK_FAST_ROLE_SWAP_REQUEST_RECEIVED_MSB                                               4U
#define PTN5110_EXT_ALERT_MASK_FAST_ROLE_SWAP_REQUEST_RECEIVED_LSB                                               4U
#define PTN5110_EXT_ALERT_MASK_FAST_ROLE_SWAP_REQUEST_RECEIVED_MASK                                              0x0010U
#define PTN5110_EXT_ALERT_MASK_ATOMIC_MESSAGE_SEQUENCE_ALERT_MSB                                                 3U
#define PTN5110_EXT_ALERT_MASK_ATOMIC_MESSAGE_SEQUENCE_ALERT_LSB                                                 3U
#define PTN5110_EXT_ALERT_MASK_ATOMIC_MESSAGE_SEQUENCE_ALERT_MASK                                                0x0008U
#define PTN5110_EXT_ALERT_MASK_USBC_STATE_CHANGE_MSB                                                             2U
#define PTN5110_EXT_ALERT_MASK_USBC_STATE_CHANGE_LSB                                                             2U
#define PTN5110_EXT_ALERT_MASK_USBC_STATE_CHANGE_MASK                                                            0x0004U
#define PTN5110_EXT_ALERT_MASK_USBC_OUTPUT_CHANGE_MSB                                                            1U
#define PTN5110_EXT_ALERT_MASK_USBC_OUTPUT_CHANGE_LSB                                                            1U
#define PTN5110_EXT_ALERT_MASK_USBC_OUTPUT_CHANGE_MASK                                                           0x0002U

/* EXT_CONFIG : */
#define PTN5110_EXT_CONFIG_IDX                                                    0x86U
#define PTN5110_EXT_CONFIG_USB_TYPE_C_FULL_STATE_MACHINE_ATTACHED_RP_VALUE_MSB    15U
#define PTN5110_EXT_CONFIG_USB_TYPE_C_FULL_STATE_MACHINE_ATTACHED_RP_VALUE_LSB    14U
#define PTN5110_EXT_CONFIG_USB_TYPE_C_FULL_STATE_MACHINE_ATTACHED_RP_VALUE_MASK   0xc000U
#define PTN5110_EXT_CONFIG_USB_TYPE_C_FULL_STATE_MACHINE_UNATTACHED_RP_VALUE_MSB  13U
#define PTN5110_EXT_CONFIG_USB_TYPE_C_FULL_STATE_MACHINE_UNATTACHED_RP_VALUE_LSB  12U
#define PTN5110_EXT_CONFIG_USB_TYPE_C_FULL_STATE_MACHINE_UNATTACHED_RP_VALUE_MASK 0x3000U
#define PTN5110_EXT_CONFIG_USB_TYPE_C_CONNECTION_STATE_MACHINE_MODE_MSB           10U
#define PTN5110_EXT_CONFIG_USB_TYPE_C_CONNECTION_STATE_MACHINE_MODE_LSB           10U
#define PTN5110_EXT_CONFIG_USB_TYPE_C_CONNECTION_STATE_MACHINE_MODE_MASK          0x0400U
#define PTN5110_EXT_CONFIG_USB_FULL_TYPE_C_CONNECTION_DETECTION_MODE_MSB          9U
#define PTN5110_EXT_CONFIG_USB_FULL_TYPE_C_CONNECTION_DETECTION_MODE_LSB          8U
#define PTN5110_EXT_CONFIG_USB_FULL_TYPE_C_CONNECTION_DETECTION_MODE_MASK         0x0300U
#define PTN5110_EXT_CONFIG_USB_FULL_TYPE_C_NORMAL_DRP_MSB                         7U
#define PTN5110_EXT_CONFIG_USB_FULL_TYPE_C_NORMAL_DRP_LSB                         7U
#define PTN5110_EXT_CONFIG_USB_FULL_TYPE_C_NORMAL_DRP_MASK                        0x0080U
#define PTN5110_EXT_CONFIG_DEBUG_CONTROL_MSB                                      6U
#define PTN5110_EXT_CONFIG_DEBUG_CONTROL_LSB                                      4U
#define PTN5110_EXT_CONFIG_DEBUG_CONTROL_MASK                                     0x0070U
#define PTN5110_EXT_CONFIG_FAST_ROLE_SWAP_ENABLE_MSB                              3U
#define PTN5110_EXT_CONFIG_FAST_ROLE_SWAP_ENABLE_LSB                              3U
#define PTN5110_EXT_CONFIG_FAST_ROLE_SWAP_ENABLE_MASK                             0x0008U
#define PTN5110_EXT_CONFIG_ATOMIC_MESSAGE_SEQUENCE_ENABLE_MSB                     2U
#define PTN5110_EXT_CONFIG_ATOMIC_MESSAGE_SEQUENCE_ENABLE_LSB                     2U
#define PTN5110_EXT_CONFIG_ATOMIC_MESSAGE_SEQUENCE_ENABLE_MASK                    0x0004U
#define PTN5110_EXT_CONFIG_AUTOMATIC_DISCHARGE_FOR_NEGATIVE_TRANSITION_MSB        1U
#define PTN5110_EXT_CONFIG_AUTOMATIC_DISCHARGE_FOR_NEGATIVE_TRANSITION_LSB        0U
#define PTN5110_EXT_CONFIG_AUTOMATIC_DISCHARGE_FOR_NEGATIVE_TRANSITION_MASK       0x0003U

