nxp-appcodehub/dm-power-delivery-frdm-a-s32k344/src/drivers/inc/ptn5110_register.h
/* EXT_FAULT_CONFIG : */
#define PTN5110_EXT_FAULT_CONFIG_IDX                               0x88U
#define PTN5110_EXT_FAULT_CONFIG_OPEN_FETS_ON_ADC_ALARM_MSB        4U
#define PTN5110_EXT_FAULT_CONFIG_OPEN_FETS_ON_ADC_ALARM_LSB        4U
#define PTN5110_EXT_FAULT_CONFIG_OPEN_FETS_ON_ADC_ALARM_MASK       0x0010U
#define PTN5110_EXT_FAULT_CONFIG_VCONN_OVER_CURRENT_LIMIT_MSB      3U
#define PTN5110_EXT_FAULT_CONFIG_VCONN_OVER_CURRENT_LIMIT_LSB      3U
#define PTN5110_EXT_FAULT_CONFIG_VCONN_OVER_CURRENT_LIMIT_MASK     0x0008U
#define PTN5110_EXT_FAULT_CONFIG_VCONN_OVER_TEMPERATURE_FAULT_MSB  2U
#define PTN5110_EXT_FAULT_CONFIG_VCONN_OVER_TEMPERATURE_FAULT_LSB  2U
#define PTN5110_EXT_FAULT_CONFIG_VCONN_OVER_TEMPERATURE_FAULT_MASK 0x0004U
#define PTN5110_EXT_FAULT_CONFIG_VCONN_REVERSE_CURRENT_FAULT_MSB   0U
#define PTN5110_EXT_FAULT_CONFIG_VCONN_REVERSE_CURRENT_FAULT_LSB   0U
#define PTN5110_EXT_FAULT_CONFIG_VCONN_REVERSE_CURRENT_FAULT_MASK  0x0001U

/* EXT_MSG_INDEX: */
#define PTN5110_EXT_MSG_INDEX_IDX 0x89U

/* EXT_TRANSMIT_BYTE_COUNT : */
#define PTN5110_EXT_TRANSMIT_BYTE_COUNT_IDX 0x8AU

/* EXT_RECEIVE_BYTE_COUNT : */
#define PTN5110_EXT_RECEIVE_BYTE_COUNT_IDX 0x8CU

/* EXT_COMMAND : */
#define PTN5110_EXT_COMMAND_IDX 0x8FU

/* EXT_STATUS : */
#define PTN5110_EXT_STATUS_IDX                                  0x90U
#define PTN5110_EXT_STATUS_VCONN_OVER_CURRENT_LIMIT_FAULT_MSB   4U
#define PTN5110_EXT_STATUS_VCONN_OVER_CURRENT_LIMIT_FAULT_LSB   4U
#define PTN5110_EXT_STATUS_VCONN_OVER_CURRENT_LIMIT_FAULT_MASK  0x0010U
#define PTN5110_EXT_STATUS_VCONN_OVER_TEMPERATURE_FAULT_MSB     3U
#define PTN5110_EXT_STATUS_VCONN_OVER_TEMPERATURE_FAULT_LSB     3U
#define PTN5110_EXT_STATUS_VCONN_OVER_TEMPERATURE_FAULT_MASK    0x0008U
#define PTN5110_EXT_STATUS_VCONN_SHORT_CIRCUIT_FAULT_MSB        2U
#define PTN5110_EXT_STATUS_VCONN_SHORT_CIRCUIT_FAULT_LSB        2U
#define PTN5110_EXT_STATUS_VCONN_SHORT_CIRCUIT_FAULT_MASK       0x0004U
#define PTN5110_EXT_STATUS_VCONN_REVERSE_CURRENT_FAULT_MSB      1U
#define PTN5110_EXT_STATUS_VCONN_REVERSE_CURRENT_FAULT_LSB      1U
#define PTN5110_EXT_STATUS_VCONN_REVERSE_CURRENT_FAULT_MASK     0x0002U
#define PTN5110_EXT_STATUS_ATOMIC_MESSAGE_SEQUENCE_REQUEST_MSB  0U
#define PTN5110_EXT_STATUS_ATOMIC_MESSAGE_SEQUENCE_REQUEST_LSB  0U
#define PTN5110_EXT_STATUS_ATOMIC_MESSAGE_SEQUENCE_REQUEST_MASK 0x0001U

/* EXT_CONTROL : */
#define PTN5110_EXT_CONTROL_IDX                                 0x8EU
#define PTN5110_EXT_CONTROL_BLEED_DISCHARGE_STRENGTH_MSB        7U
#define PTN5110_EXT_CONTROL_BLEED_DISCHARGE_STRENGTH_LSB        4U
#define PTN5110_EXT_CONTROL_BLEED_DISCHARGE_STRENGTH_MASK       0x00f0U
#define PTN5110_EXT_CONTROL_USBPD_VBUS_CONTROL_IN_PROGRESS_MSB  2U
#define PTN5110_EXT_CONTROL_USBPD_VBUS_CONTROL_IN_PROGRESS_LSB  1U
#define PTN5110_EXT_CONTROL_USBPD_VBUS_CONTROL_IN_PROGRESS_MASK 0x0006U
#define PTN5110_EXT_CONTROL_VCONN_FORCE_DISCHARGE_MSB           0U
#define PTN5110_EXT_CONTROL_VCONN_FORCE_DISCHARGE_LSB           0U
#define PTN5110_EXT_CONTROL_VCONN_FORCE_DISCHARGE_MASK          0x0001U

/* EXT_GPIO_CONFIG : */
#define PTN5110_EXT_GPIO_CONFIG_IDX               0x92U
#define PTN5110_EXT_GPIO_CONFIG_ILIM_5V_VBUS_MSB  3U
#define PTN5110_EXT_GPIO_CONFIG_ILIM_5V_VBUS_LSB  3U
#define PTN5110_EXT_GPIO_CONFIG_ILIM_5V_VBUS_MASK 0x0008U

/* EXT_GPIO_CONTROL : */
#define PTN5110_EXT_GPIO_CONTROL_IDX               0x93U
#define PTN5110_EXT_GPIO_CONTROL_ILIM_5V_VBUS_MSB  3U
#define PTN5110_EXT_GPIO_CONTROL_ILIM_5V_VBUS_LSB  3U
#define PTN5110_EXT_GPIO_CONTROL_ILIM_5V_VBUS_MASK 0x0008U

/* Register: CONFIGURE_STANDARD_OUTPUT
 */

/* Field: MUX_Control : MUX Control
00b: No connection.
01b: USB3.1 Connected
10b: DP Alternate Mode : 4 lanes
11b: USB3.1 + Display Port Lanes 0 & 1
Controlled by the TCPM
*/

typedef enum
{
    CONFIGURE_STANDARD_OUTPUT_MUX_CONTROL_NO_CONNECTION             = 0x00, /* No connection. */
    CONFIGURE_STANDARD_OUTPUT_MUX_CONTROL_USB3_ONLY                 = 0x08, /* USB3.1 Connected */
    CONFIGURE_STANDARD_OUTPUT_MUX_CONTROL_DP_ALTERNATE_MODE_4_LANES = 0x10, /* DP Alternate Mode : 4 lanes */
    CONFIGURE_STANDARD_OUTPUT_MUX_CONTROL_USB3_DP                   = 0x18, /* USB3.1 + Display Port Lanes 0 & 1 */
} MUX_Control_t;

/* Register: TCPC_CONTROL
 */

/* Field: I2C_Clock_Stretching_Control : I2C Clock Stretching Control
Clock Stretching Control
00b: Disable clock stretching. TCPC shall not perform any clock stretching during I2C transfers.
01b: Reserved
10b: Enable clock stretching. TCPC is allowed limited clock stretching during each I2C Transfer.
11b: Enable clock stretching only if the Alert pin is not asserted. As soon as Alert is asserted, clock stretching is
disabled by the TCPC.
The TCPC datasheet should contain details as to the power consequences of clock stretching as well as the max duration
of clock stretching per I2C transaction. This is only necessary if clock stretching is implemented. The TCPC shall limit
total clock stretching as detailed in Section 4.10 I2C Physical Interface Specifications.
This feature is optional. The TCPC is allowed to ignore updates to this bit field if it has not implemented clock
stretching. The power on default value is such to disable clock stretching.
*/

typedef enum
{
    DISABLE_CLOCK_STRETCHING =
        0x00, /* Disable clock stretching. TCPC shall not perform any clock stretching during I2C transfers. */
    ENABLE_CLOCK_STRETCHING =
        0x08, /* Enable clock stretching. TCPC is allowed limited clock stretching during each I2C Transfer. */
    ENABLE_CLOCK_STRETCHING_ONLY_IF_THE_ALERT_PIN_IS_NOT_ASSERTED =
        0x0c, /* Enable clock stretching only if the Alert pin is not asserted. As soon as Alert is asserted, clock */
              /* stretching is disabled by the TCPC. */
} I2C_Clock_Stretching_Control_t;

/* Register: ROLE_CONTROL
 */

/* Field: Rp_Value : Rp Value
00b: Rp default
01b: Rp 1.5A
10b: Rp 3.0A
11b: Reserved
*/

typedef enum
{
    ROLE_CONTROL_RP_DEFAULT    = 0x00, /* Rp default */
    ROLE_CONTROL_RP_VALUE_RP_1 = 0x10, /* Rp 1.5A */
    ROLE_CONTROL_RP_VALUE_RP_3 = 0x20, /* Rp 3.0A */
} Rp_Value_t;

/* Field: CC2 : CC2
00b: Ra
01b: Rp (Use Rp definition in B5..4)
10b: Rd
11b: Open (Disconnect or don't care)
Set to 11b if enabling DRP in B7..6
*/

