nxp-appcodehub/dm-power-delivery-frdm-a-s32k344/src/drivers/inc/ptn5110_register.h
typedef enum
{
    ROLE_CONTROL_CC2_RA   = 0x00, /* Ra */
    ROLE_CONTROL_CC2_RP   = 0x04, /* Rp (Use Rp definition in B5..4) */
    ROLE_CONTROL_CC2_RD   = 0x08, /* Rd */
    ROLE_CONTROL_CC2_OPEN = 0x0c, /* Open (Disconnect or don't care) */
} CC2_t;

/* Field: CC1 : CC1
00b: Ra
01b: Rp (Use Rp definition in B5..4)
10b: Rd
11b: Open (Disconnect or don't care)
Set to 11b if enabling DRP in B7..6
*/

typedef enum
{
    ROLE_CONTROL_CC1_RA   = 0x00, /* Ra */
    ROLE_CONTROL_CC1_RP   = 0x01, /* Rp (Use Rp definition in B5..4) */
    ROLE_CONTROL_CC1_RD   = 0x02, /* Rd */
    ROLE_CONTROL_CC1_OPEN = 0x03, /* Open (Disconnect or don't care) */
} CC1_t;

/* Register: CC_STATUS
 */

/* Field: CC2_State : CC2 State
If (ROLE_CONTROL.CC2=Rp) or (ConnectResult=0)
00b: SRC_Open (Open, Rp)
01b: SRC_Ra (below maximum vRa)
10b: SRC_Rd (within the vRd range)
11b: reserved

If (ROLE_CONTROL.CC2=Rd) or (ConnectResult=1)
00b: SNK_Open (Below maximum vRa)
01b: SNK_Default (Above minimum vRd-Connect)
10b: SNK_Power1_5 (Above minimum vRd-Connect) Detects Rp 1.5A
11b: SNK_Power3_0 (Above minimum vRd-Connect) Detects Rp 3.0A

If ROLE_CONTROL.CC2=Ra, this field is set to 00b
If ROLE_CONTROL.CC2=Open, this field is set to 00b
This field always returns 00b if (Look4Connection=1) or (POWER_CONTROL.EnableVconn=1 and
TCPC_CONTROL.PlugOrientation=1). Otherwise, the returned value depends upon ROLE_CONTROL.CC2.
*/

typedef enum
{
    CC_STATUS_CC2_STATE_SRC_OPEN     = 0x00, /* SRC_Open (Open, Rp) */
    CC_STATUS_CC2_STATE_SRC_RA       = 0x04, /* SRC_Ra (below maximum vRa) */
    CC_STATUS_CC2_STATE_SRC_RD       = 0x08, /* SRC_Rd (within the vRd range) */
    CC_STATUS_CC2_STATE_SNK_OPEN     = 0x00, /* SNK_Open (Below maximum vRa) */
    CC_STATUS_CC2_STATE_SNK_DEFAULT  = 0x04, /* SNK_Default (Above minimum vRd-Connect) */
    CC_STATUS_CC2_STATE_SNK_POWER1_5 = 0x08, /* SNK_Power1_5 (Above minimum vRd-Connect) Detects Rp 1.5A */
    CC_STATUS_CC2_STATE_SNK_POWER3_0 = 0x0c, /* SNK_Power3_0 (Above minimum vRd-Connect) Detects Rp 3.0A */
} CC2_State_t;

/* Field: CC1_State : CC1 State
If (ROLE_CONTROL.CC1 = Rp) or (ConnectResult=0)
00b: SRC_Open (Open, Rp)
01b: SRC_Ra (below maximum vRa)
10b: SRC_Rd (within the vRd range)
11b: reserved

If (ROLE_CONTROL.CC1 = Rd) or ConnectResult=1)
00b: SNK_Open (Below maximum vRa)
01b: SNK_Default (Above minimum vRd-Connect)
10b: SNK_Power1_5 (Above minimum vRd-Connect) Detects Rp-1.5A
11b: SNK_Power3_0 (Above minimum vRd-Connect) Detects Rp-3.0A

If ROLE_CONTROL.CC1=Ra, this field is set to 00b
If ROLE_CONTROL.CC1=Open, this field is set to 00b

This field always returns 00b if (Look4Connection=1) or (POWER_CONTROL.EnableVconn=1 and
TCPC_CONTROL.PlugOrientation=0). Otherwise, the returned value depends upon ROLE_CONTROL.CC1.
*/

typedef enum
{
    CC_STATUS_CC1_STATE_SRC_OPEN     = 0x00, /* SRC_Open (Open, Rp) */
    CC_STATUS_CC1_STATE_SRC_RA       = 0x01, /* SRC_Ra (below maximum vRa) */
    CC_STATUS_CC1_STATE_SRC_RD       = 0x02, /* SRC_Rd (within the vRd range) */
    CC_STATUS_CC1_STATE_SNK_OPEN     = 0x00, /* SNK_Open (Below maximum vRa) */
    CC_STATUS_CC1_STATE_SNK_DEFAULT  = 0x01, /* SNK_Default (Above minimum vRd-Connect) */
    CC_STATUS_CC1_STATE_SNK_POWER1_5 = 0x02, /* SNK_Power1_5 (Above minimum vRd-Connect) Detects Rp-1.5A */
    CC_STATUS_CC1_STATE_SNK_POWER3_0 = 0x03, /* SNK_Power3_0 (Above minimum vRd-Connect) Detects Rp-3.0A */
} CC1_State_t;

/* Register: COMMAND
 */

/* Field: Command : Command
0001 0001b:WakeI2C (no action is taken other than to wake the I2C interface).
0010 0010b:DisableVbusDetect. Disable Vbus present detection. The TCPC shall ignore this command and assert the
FAULT_STATUS.I2CInterfaceError if it has sourcing or sinking power over Vbus enabled.
0011 0011b:EnableVbusDetect. Enable Vbus present detection.
0100 0100b:DisableSinkVbus. Disable sinking power over Vbus. This COMMAND does not disable POWER_STATUS.VBUSPresent
detection.
0101 0101b:SinkVbus. Enable sinking power over Vbus and enable Vbus present detection. The TCPC shall ignore this
command and assert the FAULT_STATUS.I2CInterfaceError if it has sourcing power over Vbus enabled.
0110 0110b:DisableSourceVbus. Disable sourcing power over Vbus. The TCPC shall stop reporting FAULT_STATUS. Internal or
External OCP or OVP Faults. This COMMAND does not disable POWER_STATUS.VBUSPresent detection.
0111 0111b:SourceVbusDefaultVoltage. Enable sourcing vSafe5V over Vbus and enable Vbus present detection. Source shall
transition to vSafe5V if at a high voltage. The TCPC shall ignore this command and assert the
FAULT_STATUS.I2CInterfaceError if it has sinking power over Vbus enabled.
1000 1000b:SourceVbusHighVoltage. Execute sourcing high voltage over Vbus. The TCPC shall ignore this command and assert
the FAULT_STATUS.I2CInterfaceError if it is either does not have ability to source voltages higher than vSafe5V or is
already sourcing vSafe5V.  The actual voltage to be sourced may be set in a vendor defined manner. The TCPM may need to
send vendor defined commands before sending this COMMAND.
1001 1001b: Look4Connection. Start DRP Toggling if ROLE_CONTROL.DRP=1b. If ROLE_CONTROL.CC1/CC2 =  01b start with Rp, if
ROLE_CONTROL.CC1/CC2 =10b start with Rd. If ROLE_CONTROL.CC1/CC2 are not both 01b or 10b, then do not start toggling.
TCPC to MAINTAIN_STATE in Figure 4 11
1010 1010b:Reserved. No Action
1100 1100b:Reserved. No Action
1101 1101b:Reserved. No Action
1110 1110b:Reserved. No Action
1111 1111b:I2C Idle
*/

typedef enum
{
    TCPC_WAKEI2C           = 0x11, /* WakeI2C (no action is taken other than to wake the I2C interface). */
    TCPC_DISABLEVBUSDETECT = 0x22, /* DisableVbusDetect. Disable Vbus present detection. The TCPC shall ignore this */
                                   /* command and assert the FAULT_STATUS.I2CInterfaceError if it has sourcing or */
                                   /* sinking power over Vbus enabled. */
    TCPC_ENABLEVBUSDETECT = 0x33,  /* EnableVbusDetect. Enable Vbus present detection. */
    TCPC_DISABLESINKVBUS  = 0x44,  /* DisableSinkVbus. Disable sinking power over Vbus. This COMMAND does not disable */
                                   /* POWER_STATUS.VBUSPresent detection. */
    TCPC_SINKVBUS =
        0x55, /* SinkVbus. Enable sinking power over Vbus and enable Vbus present detection. The TCPC shall */
              /* ignore this command and assert the FAULT_STATUS.I2CInterfaceError if it has sourcing power */
              /* over Vbus enabled. */
    TCPC_DISABLESOURCEVBUS =
        0x66, /* DisableSourceVbus. Disable sourcing power over Vbus. The TCPC shall stop reporting */
              /* FAULT_STATUS. Internal or External OCP or OVP Faults. This COMMAND does not */
              /* disable POWER_STATUS.VBUSPresent detection. */
    TCPC_SOURCEVBUSDEFAULTVOLTAGE =
        0x77, /* SourceVbusDefaultVoltage. Enable sourcing vSafe5V over Vbus and enable Vbus */
              /* present detection. Source shall transition to vSafe5V if at a high voltage. */
              /* The TCPC shall ignore this command and assert the */
              /* FAULT_STATUS.I2CInterfaceError if it has sinking power over Vbus enabled. */
    TCPC_SOURCEVBUSHIGHVOLTAGE =
        0x88, /* SourceVbusHighVoltage. Execute sourcing high voltage over Vbus. The TCPC shall ignore this command and
               */
    /* assert the FAULT_STATUS.I2CInterfaceError if it is either does not have ability to source voltages */
    /* higher than vSafe5V or is already sourcing vSafe5V.  The actual voltage to be sourced may be set in a */
    /* vendor defined manner. The TCPM may need to send vendor defined commands before sending this COMMAND. */
    TCPC_LOOK4CONNECTION =
        0x99, /* Look4Connection. Start DRP Toggling if ROLE_CONTROL.DRP=1b. If ROLE_CONTROL.CC1/CC2 */
              /* =  01b start with Rp, if ROLE_CONTROL.CC1/CC2 =10b start with Rd. If */
              /* ROLE_CONTROL.CC1/CC2 are not both 01b or 10b, then do not start toggling. */
    TCPC_RXONEMORE =
        0xaa, /* RxOneMore. Configure the receiver to automatically clear the RECEIVE_DETECT register after */
              /* sending the next GoodCRC. This is used to shutdown reception of packets at a known point */
              /* regardless of packet separation or the depth of the receive FIFO in the TCPC. */
    TCPC_SENDFRSWAPSIGNAL = 0xcc, /* SendFRSwapSignal. Source TCPC sends Fast Role Swap signal within tTCPCSendFRSwap */
                                  /* after receiving this command if POWER_CONTROL.FastRoleSwapEnable = 1b. */
                                  /*  TCPC shall ignore this command and assert the FAULT_STATUS.I2CinterfaceError */
                                  /* if POWER_CONTROL.FastRoleSwapEnable = 0b. */
    TCPC_RESETTRASMITBUFFER =
        0xdd, /* ResetTransmitBuffer. The TCPC resets the pointer of the TRANSMIT_BUFFER register and */
              /* the contents of TRANSMIT_BUFFER becomes invalid when this command is issued by the TCPM. */
    /* This command shall be supported by TCPC compliant with USB Port Controller Specification Revision 2.0, */
    TCPC_RESETRECEIVEBUFFER =
        0xee, /* ResetReceiveBuffer. The TCPC resets the pointer of RX_BUFFER when this command is issued */
              /* by the TCPM. TCPC does not clear the content of the buffer upon receiving this command. */
              /* The TCPM issues this command in order to re-read the RECEIVE_BUFFER.RX_BUF_BYTE_x. */
    /* This command shall be supported by TCPC compliant with USB Port Controller Specification Revision 2.0,*/
    TCPC_I2C_IDLE = 0xff, /* I2C Idle */
    _N_COMMANDS   = 11,
} TcpcCommand_t;

/* Register: EXT_COMMAND
 */

