nxp-appcodehub/dm-power-delivery-frdm-a-s32k344/src/drivers/inc/ptn5110_register.h
typedef enum
{
    TRANSMIT_TRANSMIT_SOP_MESSAGE_TRANSMIT_SOP         = 0x00, /* Transmit SOP */
    TRANSMIT_TRANSMIT_SOP_MESSAGE_TRANSMIT_SOP_P       = 0x01, /* Transmit SOP' */
    TRANSMIT_TRANSMIT_SOP_MESSAGE_TRANSMIT_SOP_PP      = 0x02, /* Transmit SOP'' */
    TRANSMIT_TRANSMIT_SOP_MESSAGE_TRANSMIT_SOP_DBG_P   = 0x03, /* Transmit SOP_DBG' */
    TRANSMIT_TRANSMIT_SOP_MESSAGE_TRANSMIT_SOP_DBG_PP  = 0x04, /* Transmit SOP_DBG'' */
    TRANSMIT_TRANSMIT_SOP_MESSAGE_TRANSMIT_HARD_RESET  = 0x05, /* Transmit Hard Reset */
    TRANSMIT_TRANSMIT_SOP_MESSAGE_TRANSMIT_CABLE_RESET = 0x06, /* Transmit Cable Reset */
    TRANSMIT_TRANSMIT_SOP_MESSAGE_TRANSMIT_BIST_CARRIER_MODE_2 =
        0x07, /* Transmit BIST Carrier Mode 2 (TCPC shall exit the BIST mode no later than tBISTContMode max) */
} Transmit_SOP_message_t;

/* Register: VBUS_VOLTAGE
 */

/* Field: Vbus_Scale_Factor : Vbus Scale Factor
00: VBUS measurement not scaled.
01: VBUS measurement divided by 2
10: VBUS measurement divided by 4
11: reserved
*/

typedef enum
{
    VBUS_MEASUREMENT_NOT_SCALED   = 0x0000, /* VBUS measurement not scaled. */
    VBUS_MEASUREMENT_DIVIDED_BY_2 = 0x0400, /* VBUS measurement divided by 2 */
    VBUS_MEASUREMENT_DIVIDED_BY_4 = 0x2800, /* VBUS measurement divided by 4 */
} Vbus_Scale_Factor_t;

/* Register: EXT_CONFIG
 */

/* Field: USB_Full_TypeC_Connection_Detection_Mode : USB Full Type-C Connection Detection Mode.
00b: Disabled (Default TCPC operation)
01b: SRC only
10b: DRP SRC preferred. (Use Try.SRC state)
11b: DRP SNK preferred. (use Try.SNK state)

Full connection state machine will perform perform source or sink fet transitions at connection. Vconn will be sourced
if Ra detected. CC_ORIENT and DBG_ACC pins will be updated according to connection. USB-C output register will be
updated on connection.
*/

typedef enum
{
    EXT_CONFIG_USB_FULL_TYPE_C_CONNECTION_DETECTION_MODE_DISABLED = 0x0000, /* Disabled (Default TCPC operation) */
    EXT_CONFIG_USB_FULL_TYPE_C_CONNECTION_DETECTION_MODE_SRC_ONLY = 0x0100, /* SRC only */
    EXT_CONFIG_USB_FULL_TYPE_C_CONNECTION_DETECTION_MODE_DRP_SRC_PREFERRED =
        0x0200, /* DRP SRC preferred. (Use Try.SRC state) */
    EXT_CONFIG_USB_FULL_TYPE_C_CONNECTION_DETECTION_MODE_DRP_SNK_PREFERRED =
        0x0300, /* DRP SNK preferred. (use Try.SNK state) */
} USB_Full_TypeC_Connection_Detection_Mode_t;

/* Field: Fast_Role_Swap_Enable : Fast Role Swap Enable
00b : Disable Detection of Fast Role Swap (For TCPM with no USBPD3.0 support, and during power role swap)
01b : Enable Detection, TCPM responsible for all actions
10b : Enable Detection, TCPC to open SNK fet
11b : Enable Detection, TCPC to open SNK fet, Close SRC fet when VBUS at Vsafe5V or less.

See also EXT_GPIO_CONFIG.DBG_ACC Mode
*/

typedef enum
{
    DISABLE_DETECTION_OF_FAST_ROLE_SWAP =
        0x00, /* Disable Detection of Fast Role Swap (For TCPM with no USBPD3.0 support, and during power role swap) */
    ENABLE_DETECTION_TCPM_RESPONSIBLE_FOR_ALL_ACTIONS = 0x08, /* Enable Detection, TCPM responsible for all actions */
    ENABLE_DETECTION_TCPC_TO_OPEN_SNK_FET             = 0x10, /* Enable Detection, TCPC to open SNK fet */
    ENABLE_DETECTION_TCPC_TO_OPEN_SNK_FET_CLOSE_SRC_FET_WHEN_VBUS_AT_VSAFE5V_OR_LESS =
        0x18, /* Enable Detection, TCPC to open SNK fet, Close SRC fet when VBUS at Vsafe5V or less. */
} Fast_Role_Swap_Enable_t;

/* Field: Automatic Discharge for Negative Transition
00b : Set EN_SNK1=0, Discharge to 5V, Set EN_SRC=1
01b : Set EN_SNK1=0, Discharge to VBUS_STOP_DISCHARGE_THRESHOLD, Set EN_SRC=1
10b : Set EN_SNK1=0, Automatic discharge disabled, Allow TCPM to use force discharge, when ADC monitors 5V set EN_SRC=1
*/

typedef enum
{
    EXT_CONFIG_NEGATIVE_TRANSITION_AUTO_DISCHARGE_TO_5V        = 0x0000,
    EXT_CONFIG_NEGATIVE_TRANSITION_AUTO_DISCHARGE_TO_THRESHOLD = 0x0001,
    EXT_CONFIG_NEGATIVE_TRANSITION_AUTO_DISCHARGE_DISABLED     = 0x0002,
} Negative_Transition_Auto_Discharge_Mode_t;

/* Register: EXT_CONTROL
 */

/* Field: USBPD_VBUS_Control_In_Progress : USBPD VBUS Control In Progress (do we need this? Can just use
VBUS_SINK_DISCONNECT_THRESHOLD?)
00b : VBUS will be sourced or sinked with no expected change below sink connection threshold
01b : Hard reset in progress, SNK should not detect disconnect
10b : Power Role Swap in progress, SNK should not detect disconnect
11b : Reserved
*/

typedef enum
{
    VBUS_WILL_BE_SOURCED_OR_SINKED_WITH_NO_EXPECTED_CHANGE_BELOW_SINK_CONNECTION_THRESHOLD =
        0x00, /* VBUS will be sourced or sinked with no expected change below sink connection threshold */
    HARD_RESET_IN_PROGRESS_SNK_SHOULD_NOT_DETECT_DISCONNECT =
        0x02, /* Hard reset in progress, SNK should not detect disconnect */
    POWER_ROLE_SWAP_IN_PROGRESS_SNK_SHOULD_NOT_DETECT_DISCONNECT =
        0x04, /* Power Role Swap in progress, SNK should not detect disconnect */
} USBPD_VBUS_Control_In_Progress_t;

/* Register: FET_CONTROL
 */

/* Field: Force_FET_CONTROL : Force FET Control
00b : Controlled by TCPC, via COMMAND, in dead battery mode (EN_SNKDB controlled by HW at startup)
01b : Controlled by TCPC  via COMMAND. (Set EN_SNKDB=0)
11b : Controlled by TCPM via bits 3:0 of this register
*/

typedef enum
{
    FET_CONTROLLED_BY_TCPC_IN_DEAD_BATTERY_MODE = 0x00, /* Controlled by TCPC in dead battery mode */
    FET_CONTROLLED_BY_TCPC                      = 0x40, /* Controlled by TCPC */
    FET_CONTROLLED_BY_TCPM                      = 0xc0, /* Controlled by TCPM */
} Force_FET_CONTROL_t;

/* Field: Force_EN_SNKDB : Force EN_SNKDB
0b : Force Open
1b : Force Closed
*/

typedef enum
{
    FET_CONTROL_FORCE_EN_SNKDB_FORCE_OPEN   = 0x00, /* Force Open */
    FET_CONTROL_FORCE_EN_SNKDB_FORCE_CLOSED = 0x08, /* Force Closed */
} Force_EN_SNKDB_t;

/* Field: Force_EN_SRC : Force EN_SRC
0b : Force Open
1b : Force Closed
*/

typedef enum
{
    FET_CONTROL_FORCE_EN_SRC_FORCE_OPEN   = 0x00, /* Force Open */
    FET_CONTROL_FORCE_EN_SRC_FORCE_CLOSED = 0x04, /* Force Closed */
} Force_EN_SRC_t;

/* Field: Force_EN_SNK1 : Force EN_SNK1
0b : Force Open
1b : Force Closed
*/

