nxp-appcodehub/dm-power-delivery-frdm-a-s32k344/src/drivers/inc/ptn5110_register.h
typedef enum
{
    FET_CONTROL_FORCE_EN_SNK1_FORCE_OPEN   = 0x00, /* Force Open */
    FET_CONTROL_FORCE_EN_SNK1_FORCE_CLOSED = 0x02, /* Force Closed */
} Force_EN_SNK1_t;

/* Field: Force_EN_SNK2 : Force EN_SNK2
0b : Force Open
1b : Force Closed
*/

typedef enum
{
    FET_CONTROL_FORCE_EN_SNK2_FORCE_OPEN   = 0x00, /* Force Open */
    FET_CONTROL_FORCE_EN_SNK2_FORCE_CLOSED = 0x01, /* Force Closed */
} Force_EN_SNK2_t;

/* Register: VOLTAGE_TRANSITION_CONTROL
 */

/* Field: VOLTAGE_TRANSITION_TYPE : Discharge for Negative Transition
0b : The next SourceVbusHighVoltage will be a positive voltage transition.
1b - The next SourceVbusHighVoltage will be a negative voltage transition, discharge of VBUS should be enabled.
When set VBUS_STOP_DISCHARGE_THRESHOLD must be set to the vbus target level.
*/

typedef enum
{
    VOLTAGE_TRANSITION_CONTROL_POSITIVE_TRANSITION = 0x00,
    VOLTAGE_TRANSITION_CONTROL_NEGATIVE_TRANSITION = 0x80,
} VOLTAGE_TRANSITION_TYPE_t;

/* Field: EN_SNK1 Mode, EN_SRC Mode:
00b: Disabled
01b: Use as SinkVbus FET control
10b: Use as SourceVbusHighVoltage FET control

NOTE: This is only applied when the command register is written, so to switch from 2nd source to 3rd source rail change
this register before issuing SourceVbusHighVoltage
*/

typedef enum
{
    EN_DISABLED   = 0x00, /* Disabled */
    EN_USE_AS_SNK = 0x01,
    EN_USE_AS_SRC = 0x02,
} EN_SRC_SNK_Mode_t;

/*------------------------------------------ */
/* Registers for: identification */
/*------------------------------------------ */
#define ADDR_vendor_id        TCPC_VENDOR_ID_IDX
#define ADDR_product_id       TCPC_PRODUCT_ID_IDX
#define ADDR_device_id        TCPC_DEVICE_ID_IDX
#define ADDR_usbtypec_rev     TCPC_USBTYPEC_REV_IDX
#define ADDR_usbpd_rev_ver    TCPC_USBPD_REV_VER_IDX
#define ADDR_pd_interface_rev TCPC_PD_INTERFACE_REV_IDX

/*------------------------------------------ */
/* Registers for: alert */
/*------------------------------------------ */
#define ADDR_alert TCPC_ALERT_IDX

/*------------------------------------------ */
/* Registers for: mask */
/*------------------------------------------ */
#define ADDR_alert_mask           TCPC_ALERT_MASK_IDX
#define ADDR_power_status_mask    TCPC_POWER_STATUS_MASK_IDX
#define ADDR_fault_status_mask    TCPC_FAULT_STATUS_MASK_IDX
#define ADDR_extended_status_mask TCPC_EXTENDED_STATUS_MASK_IDX
#define ADDR_alert_extended_mask  TCPC_ALERT_EXTENDED_MASK_IDX

/*------------------------------------------ */
/* Registers for: configure standard output */
/*------------------------------------------ */
#define ADDR_config_standard_output TCPC_CONFIGURE_STANDARD_OUTPUT_IDX

/*------------------------------------------ */
/* Registers for: control */
/*------------------------------------------ */
#define ADDR_tcpc_control  TCPC_TCPC_CONTROL_IDX
#define ADDR_role_control  TCPC_ROLE_CONTROL_IDX
#define ADDR_fault_control TCPC_FAULT_CONTROL_IDX
#define ADDR_power_control TCPC_POWER_CONTROL_IDX

/*------------------------------------------ */
/* Registers for: status */
/*------------------------------------------ */
#define ADDR_cc_status       TCPC_CC_STATUS_IDX
#define ADDR_power_status    TCPC_POWER_STATUS_IDX
#define ADDR_fault_status    TCPC_FAULT_STATUS_IDX
#define ADDR_extended_status TCPC_EXTENDED_STATUS_IDX
#define ADDR_alert_extended  TCPC_ALERT_EXTENDED_IDX

/*------------------------------------------ */
/* Registers for: command */
/*------------------------------------------ */
#define ADDR_command TCPC_COMMAND_IDX

/*------------------------------------------ */
/* Registers for: capability */
/*------------------------------------------ */
#define ADDR_device_capabilities_1        TCPC_DEVICE_CAPABILITIES_1_IDX
#define ADDR_device_capabilities_2        TCPC_DEVICE_CAPABILITIES_2_IDX
#define ADDR_standard_input_capabilities  TCPC_STANDARD_INPUT_CAPABILITIES_IDX
#define ADDR_standard_output_capabilities TCPC_STANDARD_OUTPUT_CAPABILITIES_IDX

/*------------------------------------------ */
/* Registers for: message receive */
/*------------------------------------------ */
#define ADDR_message_header_info TCPC_MESSAGE_HEADER_INFO_IDX
#define ADDR_receive_detect      TCPC_RECEIVE_DETECT_IDX
#define ADDR_receive_byte_count  TCPC_RECEIVE_BYTE_COUNT_IDX
#define ADDR_rx_buf_frame_type   TCPC_RX_BUF_FRAME_TYPE_IDX
#define ADDR_rx_buf_header       TCPC_RX_BUF_HEADER_IDX
#define ADDR_rx_buf_obj1         TCPC_RX_BUF_OBJ1_IDX
#define ADDR_rx_buf_obj2         TCPC_RX_BUF_OBJ2_IDX
#define ADDR_rx_buf_obj3         TCPC_RX_BUF_OBJ3_IDX
#define ADDR_rx_buf_obj4         TCPC_RX_BUF_OBJ4_IDX
#define ADDR_rx_buf_obj5         TCPC_RX_BUF_OBJ5_IDX
#define ADDR_rx_buf_obj6         TCPC_RX_BUF_OBJ6_IDX
#define ADDR_rx_buf_obj7         TCPC_RX_BUF_OBJ7_IDX

#define POR_receive_detect      0x00
#define POR_receive_detect_mask 0x7F

/*------------------------------------------ */
/* Registers for: message transmit */
/*------------------------------------------ */
#define ADDR_transmit            TCPC_TRANSMIT_IDX
#define ADDR_transmit_byte_count TCPC_TRANSMIT_BYTE_COUNT_IDX
#define ADDR_tx_buf_header       TCPC_TX_BUF_HEADER_IDX
#define ADDR_tx_buf_obj1         TCPC_TX_BUF_OBJ1_IDX
#define ADDR_tx_buf_obj2         TCPC_TX_BUF_OBJ2_IDX
#define ADDR_tx_buf_obj3         TCPC_TX_BUF_OBJ3_IDX
#define ADDR_tx_buf_obj4         TCPC_TX_BUF_OBJ4_IDX
#define ADDR_tx_buf_obj5         TCPC_TX_BUF_OBJ5_IDX
#define ADDR_tx_buf_obj6         TCPC_TX_BUF_OBJ6_IDX
#define ADDR_tx_buf_obj7         TCPC_TX_BUF_OBJ7_IDX

/*------------------------------------------ */
/* Registers for: voltage monitor/thresholds */
/*------------------------------------------ */
#define ADDR_vbus_voltage                   TCPC_VBUS_VOLTAGE_IDX
#define ADDR_vbus_sink_disconnect_threshold TCPC_VBUS_SINK_DISCONNECT_THRESHOLD_IDX
#define ADDR_vbus_stop_discharge_threshold  TCPC_VBUS_STOP_DISCHARGE_THRESHOLD_IDX
#define ADDR_vbus_voltage_alarm_hi_cfg      TCPC_VBUS_VOLTAGE_ALARM_HI_CFG_IDX
#define ADDR_vbus_voltage_alarm_lo_cfg      TCPC_VBUS_VOLTAGE_ALARM_LO_CFG_IDX

/*------------------------------------------ */
/* Registers for: PTN5110 extended */
/*------------------------------------------ */
#define ADDR_ptn5110_ext_alert               PTN5110_EXT_ALERT_IDX
#define ADDR_ptn5110_ext_alert_mask          PTN5110_EXT_ALERT_MASK_IDX
#define ADDR_ptn5110_ext_config              PTN5110_EXT_CONFIG_IDX
#define ADDR_ptn5110_ext_control             PTN5110_EXT_CONTROL_IDX
#define ADDR_ptn5110_ext_command             PTN5110_EXT_COMMAND_IDX
#define ADDR_ptn5110_ext_fault_config        PTN5110_EXT_FAULT_CONFIG_IDX
#define ADDR_ptn5110_ext_status              PTN5110_EXT_STATUS_IDX
#define ADDR_ptn5110_ext_msg_index           PTN5110_EXT_MSG_INDEX_IDX
#define ADDR_ptn5110_ext_transmit_byte_count PTN5110_EXT_TRANSMIT_BYTE_COUNT_IDX
#define ADDR_ptn5110_ext_receive_byte_count  PTN5110_EXT_RECEIVE_BYTE_COUNT_IDX
#define ADDR_ptn5110_ext_gpio_config         PTN5110_EXT_GPIO_CONFIG_IDX
#define ADDR_ptn5110_ext_gpio_control        PTN5110_EXT_GPIO_CONTROL_IDX


#endif /* PTN5110_REGISTER_H_ */
